#include <stdio.h>

int main(void) {
    int a = 0, k = 0;
    int res = 0;

    scanf("%d %d", &a, &k);
    res = 1;
    //пока степень больше нуля
    while (k > 0) {
        // если степень чётная, то
        if (k % 2 == 0) {
            a = a * a;      // умножаем текущий результат на себя
            k = k / 2;      // степень делим пополам
        } else {            //если степень нечётная
            res = res * a;  // то умножаем на исходное число
            k = k - 1;      // от степени вычитаем единицу
        }
    }
    printf("%d\n", res);

    return 0;
}