//Последовательность
//Вывести последовательность чисел, поступившую на вход.
//в конце последовательности записано число -9999 
#include <stdio.h>

int main() {
 int N;
   while(N != -9999){
    scanf("%d",&N);
    printf("%d ",N);
   }
 
  return 0;
}